module.exports.config = {
  name: "لستة",
  version: "2.0.0",
  hasPermssion: 0,
  credits: "XAVIER",
  description: "عرض قائمة الاوامر مع طريقة الاستخدام",
  commandCategory: "أوامر",
  usages: "لستة",
  cooldowns: 0
};

module.exports.run = async function({ api, event }) {
  const { threadID, messageID } = event;

  const msg =
`˖ִ 〆 ↯ 𝐕꯭𝐎𝐈𝖲𝖮𝐍 𒀱 𝛃𝐎𝐓⋆ ⏤ 🇲🇹

𝟏-ادمن
- تحكم بكل صلاحيات البوت وقائمة الادمن 
-الاوامر المساعدة*[ادمن فقط]،[ادمن الكل]،[ادمن تحديث ID]،[ادمن ازالة ID].

𝟐-ادمنقروب
-اضافة البوت كأدمن في قروب محدد 
-الاوامر المساعدة*[ادمنقروب -رقم القروب] 

𝟑-اسم
-تغيير اسم الكروب مع الحماية من التغيير 
-الاوامر المساعدة*[اسم-الاسم المراد تغييره]،[اسم توقف] 

𝟒-الادمنز
-عرض قائمة خاصة بأدمنز البوت 

𝟓-تجاهل
—تجاهل اي شخص غير أدمن البوت نهائياً [يستثنى حالات تغيير اسم القروب] 
-الاوامر المساعدة*[تجاهل]،[تجاهل توقف] 

𝟔-تحديث
-تحديث رسالة التوسيع التي ترسل كل 30 ثانية
-الاوامر المساعدة*[تحديث رسالة-النص المراد تحديثه] 

𝟕-حذف
-حذف الرسالة عن طريق الرد عليها وكتابة حذف
-الاوامر المساعدة*[حذف] 

𝟖-حمايةاسم
-حماية اسم الكروب من التغيير ويرجع تلقائيّا 
-الاوامر المساعدة*[حمايةاسم-الاسم المراد حمايته]،[حمايةاسم توقف]

𝟗-حمايةكنية
-حماية كنيات الكروب من التغيير 
-الاوامر المساعدة*[حمايةكنية-الاسم المراد حمايته]،[حمايةكنية توقف] 

𝟏𝟎-توسيع المجال
-عند قول تفعيل توسيع يرسل 𝐀𝐔𝐓𝐎 𝐑𝐄𝐏𝐋𝐀𝐘 رسالة كل 30 ثانية 
-الاوامر المساعدة*[تفعيل توسيع]،[كسر التوسيع] 

𝟏𝟏-قروبات
-قائمة القروبات التي يوجد فيها البوت مع التحكم فكل قروب 
-الاوامر المساعدة*[قروبات]،[قروبات تعطيل-رقم القروب المراد تعطيله]،[قروبات تفعيل-رقم القروب المراد تفعيله] 

𝟏𝟐-كنيات
-تغيير كنيات جميع اعضاء الكروب 
-الاوامر المساعدة*[كنيات-الاسم المراد تغيير الكنيات به]،[كنيات توقف] 

𝟏𝟑-لستة
-عرض قائمة الاوامر مع طريقة الاستخدام 
-الاوامر المساعدة*[لستة] 

𝟏𝟒-نقل
-اضافة اي شخص بواسطة البوت الى اي من الغروبات المتواجد بها الشخص عن طريق التاغ او عنوان 𝖨𝖣 الخاص به
-الاوامر المساعدة*[نقل @شخص-رقم الغروب المراد نقله اليه]،[نقل 𝖨𝖣شخص-رقم الغروب المراد نقله اليه] 

𝟏𝟓-اطلع برا
-إخراج البوت من القروب تلقائياً بدون طرد 
-الاوامر المساعدة*[اطلع برا] 


ꕺ إجمالي الاوامر المستدعاة: 𝟏𝟓 ꕺ`;

  return api.sendMessage(msg, threadID, messageID);
};
