module.exports.config = {
  name: "لستة",
  version: "3.0.0",
  hasPermssion: 0,
  credits: "XAVIER",
  description: "عرض قائمة الاوامر",
  commandCategory: "أوامر",
  usages: "لستة | لستة 2",
  cooldowns: 0
};

module.exports.run = async function({ api, event, args }) {
  const { threadID, messageID } = event;

  const page = args[0] === "2" ? 2 : 1;

  if (page === 1) {
    const msg =
`🪯 𝕱𝗂𝗋𝗌𝗍 𝖼𝗈𝗆𝗆𝖺𝗇𝖽 𝙈𝖾𝗇𝗎
⩽  1/2 ⩾

𝟭-𝘼𝘥𝗺𝗂𝗇𝘀 𝗖𝗈𝗇𝗍𝗋𝗈𝗅:
-تحكم بكل صلاحيات البوت وقائمة الادمن. 👁️‍🗨️
-الاوامر المساعدة*[ادمن فقط]،[ادمن الكل]،[ادمن تحديث ID]،[ادمن ازالة ID]. ꗇ

𝟮-𝙍𝘦𝘮𝘱𝘢𝘨𝘦:
-إزالة كل الادمنز في القروب واضافة البوت كأدمن. 👁️‍🗨️
-الاوامر المساعدة*[ابادة تفعيل]. ꗇ

𝟯-𝗡𝖺𝗆𝖾:
-تغيير اسم الكروب مع الحماية من التغيير. 👁️‍🗨️
-الاوامر المساعدة*[اسم الاسم]،[اسم توقف]،[اسم حماية]،[اسم حماية لا]. ꗇ

𝟰-𝗔𝖽𝗆𝗂𝗇𝗌:
-عرض قائمة خاصة بأدمنز البوت. 👁️‍🗨️
-الامر خاص بادمن البوت فقط!! ꗇ

𝟱-𝗦𝗂𝗅𝖾𝗇𝗍:
-تجاهل اي شخص غير أدمن البوت نهائياً. 👁️‍🗨️
-الاوامر المساعدة*[تجاهل]،[تجاهل توقف]. ꗇ

𝟲-𝗨𝗉𝖽𝖺𝗍𝖾:
-تحديث رسالة زينو التي ترسل كل 30 ثانية. 👁️‍🗨️
-الاوامر المساعدة*[تحديث رسالة النص المراد تحديثه]. ꗇ

𝟳-𝗗𝗈𝗺𝖺𝗂𝗇 𝖤𝗑𝗉𝖾𝗇𝗍𝗂𝗈𝗇:
-عند قول تفعيل توسيع يرسل زينو رسالة كل 30 ثانية. 👁️‍🗨️
-الاوامر المساعدة*[تفعيل توسيع]،[كسر التوسيع]. ꗇ

𝖯𝗅𝖾𝖺𝗌𝖾 𝗌𝖺𝗒 لستة 2 𝗍𝗈 𝖦𝗈 𝗍𝗈 𝗍𝗁𝖾 𝗌𝖾𝖼𝗈𝗇𝖽 𝗆𝖾𝗇𝗎 ꗇ`;

    return api.sendMessage(msg, threadID, messageID);
  }

  if (page === 2) {
    const msg =
`🪯 𝕾𝖾𝖼𝗈𝗇𝖽 𝖼𝗈𝗆𝗆𝖺𝗇𝖽 𝙈𝖾𝗇𝗎
⩽  2/2 ⩾

𝟴-𝗡𝗂𝖼𝗄𝗇𝖺𝗆𝖾𝗌:
-تغيير كنيات الكروب مع الحماية. 👁️‍🗨️
-الاوامر المساعدة*[كنيات الاسم]،[كنيات توقف]،[كنيات حماية الكنية]،[كنيات حماية لا]. ꗇ

𝟵-𝗞𝗂𝖼𝗄:
-طرد شخص عند الرد على رسالته. 👁️‍🗨️
-الاوامر المساعدة*[طرد - مع الرد على رسالة الشخص]. ꗇ

𝟭𝟬-𝗙𝗈𝗈𝗍𝖻𝖺𝗅𝗅 𝗤𝘂𝗂𝘇:
-سؤال عن لاعب كرة قدم لديك 60 ثانية للإجابة. 👁️‍🗨️
-الاوامر المساعدة*[كرة]. ꗇ

𝟭𝟭-𝗧𝗿𝘂𝗍𝗵 𝗼𝗿 𝗗𝖺𝗋𝖾:
-لعبة صراحة وجرأة. 👁️‍🗨️
-الاوامر المساعدة*[صراحة صراحة]،[صراحة جرأة]. ꗇ

𝟭𝟮-𝗤𝗎𝖾𝗌𝗍𝗂𝗈𝗇𝗌:
-سؤال عشوائي للكروب. 👁️‍🗨️
-الاوامر المساعدة*[اسئلة]. ꗇ

𝟭𝟯-𝗜𝗇𝗾𝘂𝗂𝗿𝗒:
-البوت يرد على أي سؤال تسأله. 👁️‍🗨️
-الاوامر المساعدة*[استفسار السؤال]. ꗇ

𝟭𝟰-𝗚𝗋𝗼𝘂𝗽𝗌:
-قائمة القروبات مع التحكم بكل قروب. 👁️‍🗨️
-الاوامر المساعدة*[قروبات]،[قروبات تعطيل رقم]،[قروبات تفعيل رقم]. ꗇ

ꕺ إجمالي الاوامر: 𝟏𝟒 ꕺ`;

    return api.sendMessage(msg, threadID, messageID);
  }
};
